Revit 2027 API
ParameterTypeId.FabricationPartSheetmetalArea Property
 "Part Sheet Metal Area"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationPartSheetmetalArea { get; }
Public Shared ReadOnly Property FabricationPartSheetmetalArea As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationPartSheetmetalArea {
	ForgeTypeId^ get ();
}
static member FabricationPartSheetmetalArea : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace